[
    {
        "title": "Golden Lor - Retail Management System",
        "description": "Implemented user interfaces, ensuring seamless API integration with the backend team. Optimized source code for better performance and scalability. Applied debounce and throttle and more techniques to optimize interactive application performance\nDeveloped and managed interface logic for handling resources, food items, and store data, ensuring efficient system operations.\nEnsured timely product delivery, meeting project deadlines and delivering a fully functional system to customers on schedule.\nSuccessfully contributed to stable and scalable web applications, maintaining high performance and user-friendly experiences.\nDelivered products on time, aligning with project schedules and customer expectations.",
        "type": "Freelance Project",
        "imageUrl": "/assets/images/golden.cyber-nerds.site_.webp",
        "githubUrl": "",
        "demoUrl": "https://golden.cyber-nerds.site/",
        "skills": [
            "TypeScript",
            "ReactJs",
            "NestJs",
            "Vercel",
            "REST APIs",
            "Socket.io",
            "MongoDB",
            "I18n",
            "Axios",
            "DaisyUI",
            "Cloudinary",
            "Stripe"
        ]
    },
    {
        "title": "Gloria",
        "description": "A web application providing a digital menu system that helps manage menus easily. Led the frontend team in designing and developing the user interface using React and Tailwind CSS. Collaborated closely with the backend team to ensure seamless integration and optimize performance. The project also involved implementing features for menu customization, real-time updates, and user management. Developed and maintained front-end using Next.js and TailwindCSS, optimized user experience leading to a 40% reduction in load time.\nImplemented real-time notifications using Socket.io, enhancing user engagement by 20%.",
        "imageUrl": "/assets/images/Gloria.webp",
        "githubUrl": "",
        "demoUrl": "https://gloria-alpha.vercel.app/",
        "skills": [
            "TypeScript",
            "ReactJs",
            "NestJs",
            "Vercel",
            "REST APIs",
            "Socket.io",
            "MongoDB",
            "I18n",
            "Axios",
            "DaisyUI",
            "Cloudinary",
            "Stripe"
        ]
    },
    {
        "title": "Block Sign",
        "description": "A web application to help users to manage their contract, information. A collaboration project with 5 other students for Component-based Software Engineering course. The project is built using Nestjs for the backend and NextJS for the frontend.",
        "type": "Bachelor's Degree Final Year Project",
        "imageUrl": "/assets/images/BlockSign.webp",
        "githubUrl": "",
        "demoUrl": "https://block-sign.vercel.app/vi",
        "skills": [
            "Nextjs",
            "TypeScript",
            "NextJS",
            "MongoDB",
            "Tailwind CSS",
            "Shadcn UI",
            "I18n",
            "React Query",
            "Zustand",
            "Axios",
            "Telegram API",
            "React Hook Form",
            "Cloudinary",
            "Stripe",
            "AceternityUI",
            "Lucide"
        ]
    },
    {
        "title": "Perry Toc Chien – A Seamless Dual Booking Platform",
        "description": "Successfully integrated Sepay for seamless online transactions, enhancing user experience and security.\nAchieved a Real Experience Score (RES) of 100 on Google PageSpeed Insights, ensuring fast and smooth interactions.\nImplemented SEO best practices for faster indexing and improved search rankings.\nMaintained a highly optimized and SEO-friendly platform, boosting search visibility and organic reach.\nEnsured seamless payment transactions through Sepay, improving checkout flow and user trust.",
        "type": "Freelance Project",
        "imageUrl": "/assets/images/www.perrytocchien.vn_.webp",
        "demoUrl": "https://www.perrytocchien.vn/",
        "skills": [
            "PrismaDb",
            "Nextjs",
            "TypeScript",
            "Tailwind CSS",
            "React Query",
            "Zod",
            "Axios",
            "MongoDB",
            "I18n",
            "React Hook Form",
            "Cloudinary",
            "Sepay",
            "Shadcn UI",
            "Lucide",
            "SEO",
            "Server actions"
        ]
    },
    {
        "title": "Lexai - The AI-powered language translation tool",
        "description": "Natural AI Translation – Ensuring smooth and accurate meaning delivery.\nGrammar Analysis – Understanding sentence structure effectively.\nCultural Adaptation – Providing contextually appropriate translations for different languages.\nRoles & Responsibilities\nFull-Stack Development: Engineered a scalable, ensuring optimal AI integration.\nAchievements\nTrusted by 300+ users, with real-time monitoring and optimization based on analytics insights.",
        "type": "Freelance Project",
        "imageUrl": "/assets/images/lexai.webp",
        "demoUrl": "https://lexai.cyber-nerds.site/",
        "skills": [
            "Nextjs",
            "OpenAI",
            "TypeScript",
            "Tailwind CSS",
            "OpenRouter",
            "Axios",
            "Shadcn UI",
            "Lucide",
            "SEO"
        ]
    }
]
