[
    {
        "position": "Full-stack Developer",
        "company": "TIEN PHONG CDS JOINT STOCK COMPANY",
        "duration": "Oct 2024 - Present",
        "responsibilities": [
            "AI-Code: A newly developed R&D-driven product where I played a key role in backend module development. Designed a scalable system architecture, modularization, optimized APIs, integrated AWS services (Bedrock, S3,...), implemented Data-Loader to minimize N+1 queries, integrated SSO (Facebook, X, Google), and developed a hybrid GraphQL & RESTful API solution for flexibility and performance.",
            "Vietnam Food Map: Successfully launched on the AI-Code platform, leveraging its new architecture. Led backend development, focusing on API efficiency.",
            "Roles & Responsibilities: Led the development of core backend modules, ensuring efficient AI integration and real-time data processing. Designed and optimized API infrastructure, deployed modular components, and enhanced system performance for scalability and efficiency.",
            "Achievements: Successfully launched Vietnam Food Map based on the AI-Code architecture. Recognized for technical excellence. Recommended for salary negotiations twice a year due to contributions.",
            "Demo: vietnamfoodmap.com.vn"
        ],
        "skills": [
            "PHP",
            "Nextjs",
            "Aws",
            "GraphQL",
            "Lumen mirco framework/Laravel",
            "Docker",
            "Redis",
            "RabbitMQ",
            "Kafka",
            "Design Patterns (Singleton, Factory, ...)"
        ]
    },
    {
        "position": "Front-end Developer",
        "company": "FPT Polytechnic College",
        "duration": "Aug 2023 - Feb 2024",
        "responsibilities": [
            "Built user interface, connected APIs from the Back-end team, optimized source code, and improved website performance.",
            "Handled interface design and logic implementation for various website functions.",
            "Applied debounce and throttle, ...etc techniques to optimize interactive application performance.",
            "Roles & Responsibilities: Developed and optimized React, Next.js, and Redux-based applications, improving system responsiveness and efficiency. Collaborated with cross-functional teams, ensuring timely delivery and high-quality product outcomes.",
            "Achievements: Contributed to stable and high-performing web applications, supporting thousands of users.",
            "Demo: xuongthuchanh.poly.edu.vn"
        ],
        "skills": [
            "TypeScript",
            "React",
            "Tailwind CSS",
            "RTK Query",
            "Redux toolkit",
            "JWT",
            "NestJs",
            "MongoDB",
            "I18n",
            "Zod",
            "React Query",
            "Socket.io",
            "Firebase"
        ]
    },
    {
        "position": "Back-end Developer",
        "company": "TIEN PHONG CDS JOINT STOCK COMPANY",
        "duration": "Dec 2023 - June 2024",
        "responsibilities": [
            "King Coffee, Appnoithat, Eproshop: Contributed 60%+ to API maintenance, system optimization, and bug fixes to enhance performance and stability. Focused on refactoring legacy code, reducing API response times, and improving error handling.",
            "FlyFood: Developed new APIs to enhance system functionality, ensuring seamless data processing and integration. Improve API efficiency.",
            "Vincss Single Sign-On: Developed a secure authentication module with OAuth2 & JWT for improved user security and session management (Packagist).",
            "Demo: flyfood.vn, us.kingcoffee.com, appnoithat.com, eproshop.vn"
        ],
        "skills": [
            "PHP",
            "Nextjs",
            "REST APIs",
            "Docker",
            "Redis",
            "Webhook",
            "Git",
            "Lumen mirco framework/Laravel",
            "MySQL",
            "PostgreSQL"
        ]
    }
]
